[
    {
        "id": "1ggyo5m",
        "title": "Swapping out SentinelOne for BlackPoint Cyber Only + Built-In Windows Defender",
        "summary": "The poster is considering switching from SentinelOne to BlackPoint Cyber's MDR SNAP agent, believing it offers greater benefits at a similar price point.",
        "competitor": "blackpoint cyber",
        "sentiment": "Negative",
        "author_name": "Clean_Background_318",
        "creation_time_utc": 1730440000000,
        "number_of_comments": 10,
        "url": "https:\/\/www.reddit.com\/r\/msp\/comments\/1ggyo5m\/swapping_out_sentinelone_for_blackpoint_cyber\/",
        "action_object": {
            "take_action": true,
            "what_action": "Reach out to the customer to understand their specific needs and concerns and provide information about SentinelOne's unique value propositions.",
            "response": "Hello Clean_Background_318,\n\nThank you for sharing your thoughts about considering a switch from SentinelOne to BlackPoint Cyber. Our goal is to ensure that you have the most effective cybersecurity solution for your needs, and we would like to better understand your specific requirements and any concerns you may have with SentinelOne. Could you please share more details about what benefits you're looking for and any particular issues you've experienced? We're here to assist and discuss how SentinelOne can continue to provide optimal security solutions for your environment.\n\nLooking forward to your response.\n\nBest regards,\n[Your Name]\nSentinelOne Sales Team"
        }
    },
    {
        "id": "1helmpo",
        "title": "SentinelOne Missed Threats",
        "summary": "The poster expresses frustration after SentinelOne failed to detect a significant infection on a client's PC, leading them to consider switching to Windows Defender and using Blackpoint Cyber for additional protection.",
        "competitor": "blackpoint cyber",
        "sentiment": "Negative",
        "author_name": "Clean_Background_318",
        "creation_time_utc": 1734239706000,
        "number_of_comments": 10,
        "url": "https:\/\/www.reddit.com\/r\/msp\/comments\/1helmpo\/sentinelone_missed_threats\/",
        "action_object": {
            "take_action": true,
            "what_action": "Reach out to the customer to understand their experience and offer support to address the issue with SentinelOne.",
            "response": "Hello Clean_Background_318,\n\nI'm sorry to hear about the difficulties you've faced with SentinelOne. Your experience is important to us, and we'd like to help to improve it. Could you please provide more details about the specific threat that was missed, and any other concerns you might have? Our team is ready to assist you and ensure that your client's PC is secured with the best possible solutions. We appreciate your feedback and look forward to resolving this issue for you.\n\nThank you,\n[Your Name]\nCustomer Support"
        }
    },
    {
        "id": "1i91rqa",
        "title": "DNSFilter with SentinelOne",
        "summary": "The poster discusses issues with co-existing web filtering software (DNSFilter) and SentinelOne, specifically regarding challenges in unquarantining machines after infections due to the interplay between the two services.",
        "competitor": "dnsfilter",
        "sentiment": "Negative",
        "author_name": "schwags",
        "creation_time_utc": 1737741990000,
        "number_of_comments": 10,
        "url": "https:\/\/www.reddit.com\/r\/msp\/comments\/1i91rqa\/dnsfilter_with_sentinelone\/",
        "action_object": {
            "take_action": true,
            "what_action": "Reach out to the customer to better understand the technical issues they are facing with SentinelOne and DNSFilter and offer troubleshooting support or potential solutions.",
            "response": "Hello schwags,\n\nThank you for bringing this issue to our attention. We understand the challenges of managing web filtering software alongside SentinelOne, especially when it comes to unquarantining machines after infections. We would like to help resolve the issues you're facing. Could you please provide more details about the specific problems you are experiencing or any error messages you encounter? Our technical team is ready to assist you with troubleshooting and finding an optimal solution.\n\nLooking forward to your response.\n\nBest regards,\n[Your Name] \nCustomer Support Team"
        }
    }
]