{
    "title": "When has SentinelOne failed for you?",
    "text": "Hello,\n\nI am looking to collect some edge cases where SentinelOne has failed in the past. We are testing EDR solutions I have seen several people mentioning failures but without specifics.\n\n&#x200B;\n\nAnyone have any information you can share?",
    "score": 18,
    "creation_time_utc": "2024-02-06 21:29:08",
    "id": "1akl7wr",
    "url": "https://www.reddit.com/r/msp/comments/1akl7wr/when_has_sentinelone_failed_for_you/",
    "author_name": "wiregl1tch",
    "comments": [
        {
            "id": "kp8qa9l",
            "text": "Can't speak from experience, but anecdotally, I noticed the trend of people praising Huntress saving them from something nasty mentioning that Sentinel1 was the EPP missed it. \n\nEmotet and the 3CX hack come to mind, but I don't recall if that was here or somewhere else.  \n\nTake that with a grain of salt as S1 probably has a larger install base here at MSP land than other security solutions.  \n\n\nMy opinion is they are all going to be roughly the same with some minor differences.  Managment options, dashboard, additional features, etc.\n\nOne of our differentiators was that unknown files/links are executed in a cloud sandbox before they are allowed to run on the live computer.  IMHO that is a significantly stronger security posture.",
            "score": 12,
            "author_name": "CamachoGrande",
            "creation_time_utc": "2024-02-06 22:04:07"
        },
        {
            "id": "kp8tvgl",
            "text": "i play around with some EDR's, recently we removed s1 & put on huntres, huntress isolated and remediated a threat within 15-20minutes of it being installed.  \n\n\nAll we know is that the trojan found, was installed on the machine for months and longer than we had S1 on it.   \n\n\nS1 told me 'well you should OOB this and OOB that' excuse, whereas i didnt really configure anything on huntress as its more MDR, and no config really.  \n\n\nAnyways huntress and never go back unless for some reason you fancy having your own soc team.",
            "score": 28,
            "author_name": "CreepyOlGuy",
            "creation_time_utc": "2024-02-06 22:24:43"
        },
        {
            "id": "kp8xr0v",
            "text": "We left S1 after testing huntress. Not really apples to apples but ultimately we moved everything to huntress and the difference is noticeable in terms of protection and issues. Also, it’s not always all about the product but the company behind it and the couple of times we’ve had questions. They’ve gone above and beyond anyone else.",
            "score": 14,
            "author_name": "itaniumonline",
            "creation_time_utc": "2024-02-06 22:47:22"
        },
        {
            "id": "kp9nqbq",
            "text": "Huntress has to get more name recognition cred. Basically we have to use a “name brand” endpoint or get shit on.  I would leave S1 if conditions were right.",
            "score": 5,
            "author_name": "bazjoe",
            "creation_time_utc": "2024-02-07 01:30:37"
        },
        {
            "id": "kpaehs2",
            "text": "Been using S1 for over a year now alongside Huntress. In the process of making the decision to flick it for Defender with Huntress.\n\nOverall S1 is pretty decent, however it has missed some things I would have expected it to pickup.\n\nOn two occasions, S1 techs have added custom rules to our NFR tenant which caused a tonne of incidents and devices being isolated for no reason. I knew exactly what happened, however it took over a week for support (via Pax8) to acknowledge this.\n\nI would hate to see what the support process would be like in an urgent scenario if there was shit going down...",
            "score": 6,
            "author_name": "koungz",
            "creation_time_utc": "2024-02-07 04:36:26"
        },
        {
            "id": "kpc0srv",
            "text": "We have a (now) municipal client that used S1 across the board, with a 3rd party (and very expensive) SoC monitoring it.\n\nOur other client who shared their network, we use huntress with. The attacker crossed into their network and was very shortly isolated by huntress. We alerted the parent network admins, who alerted their SoC, who then attested everything was clean.\n\nWhen we later shared huntresses IoC's and forced their SoC to look for them, we then found they had been walking all over their network unchecked for almost 2 weeks.\n\nTheir IR ended up costing tens of thousands of dollars because of S1 and their monitoring SoC's inability to detect anything wrong without first giving them exactly what to look for.\n\nDon't get me wrong, S1 isn't a bad product by any means, but the Huntress team is just really really good at what they do, and so we deploy huntress on 100% of everything we touch and they've saved our bacon numerous times.",
            "score": 5,
            "author_name": "WizardOfGunMonkeys",
            "creation_time_utc": "2024-02-07 14:25:52"
        },
        {
            "id": "kp9s1os",
            "text": "It flagged the init system on several of our docker containers, their solution was to whitelist every container image on the server with a wildcard, and even after getting to tier 3, they saw nothing wrong with functionally disabling the product.  This was the CW supported version of Sentinel One.  Definitely a \"WTF am I paying you for?\" moment.",
            "score": 5,
            "author_name": "FireStormOOO",
            "creation_time_utc": "2024-02-07 01:58:17"
        },
        {
            "id": "kpafgq3",
            "text": "I wouldn’t consider this a failure but we use Axcient for BC/DR. On two servers and one workstation, S1 quarantined the MSI installer and a bunch of the application files and broke the replibit agent. At random, and only on a couple of machines. Not site specific or role specific. Just random. \n\nAfter rolling back the changes everything went well but I has made me question how it decides if something is “bad enough” to remediate…",
            "score": 3,
            "author_name": "jakesee1",
            "creation_time_utc": "2024-02-07 04:44:25"
        },
        {
            "id": "kpbrqco",
            "text": "Had a shared tennent that got hacked through a vpn connection we didn’t control.  We ran huntress, firewall network ran sentinel one.  We have about 30 seats, they have about 260.  Huntress immediately caught all lateral movements from day one and alerted and locked down etc.  5 days in sentinel one still hadn’t found a thing.  Not one thing.  It was my huntress reports that finally got them to see they had an issue on their side and they finally got it fixed.  I am now consulting the other network too.",
            "score": 3,
            "author_name": "Garknowmuch",
            "creation_time_utc": "2024-02-07 13:20:48"
        }
    ]
}