{
    "title": "SentinelOne ever going to be more popular than CRWD?",
    "text": "We all hear about Crowdstrike being the number #1 choice for large enterprises for MDR/XDR protection.  However, I also keep hearing about SentinelOne being a strong contender and being widely adopted in SMBs.  I believe Crowdstrike has had a longer runway than SentinelOne and so they are more popular but does anyone here truly believe if SentinelOne will ever be able to give Crowdstike a run for their money?  \n\nBased on your experience, do you see SentinelOne taking over Crowdstrike's marketshare in the next few years?  I am seeing a lot of momentum on SentinelOne at the moment and want to check if other' share similar observation.   ",
    "score": 22,
    "creation_time_utc": "2024-05-12 03:53:05",
    "id": "1cpz1wh",
    "url": "https://www.reddit.com/r/msp/comments/1cpz1wh/sentinelone_ever_going_to_be_more_popular_than/",
    "author_name": "euler2020",
    "comments": [
        {
            "id": "l3o2wg9",
            "text": "There could be 2 ways this could happen  \n1. CS makes bad decisions which leads them in a downfall spiral (it could be being bought by a non-cyber buyer for instance) \n\n2. Gartner, Forrester and others find S1 better than CS and enterprises go along with this assessment\n\n  \nThe market changes constantly, so anything can happen",
            "score": 17,
            "author_name": "Nesher86",
            "creation_time_utc": "2024-05-12 04:11:12"
        },
        {
            "id": "l3pz1fy",
            "text": "I don't ever see it happening, because it appears Crowdstrike is going more downmarket with Pax8 and they just announced a partnership with Ninja. S1 did this years before CRWD and had the advantage with MSPs and SMBs that way. \n\nI did extensive testing a year ago and found CRWD to be much better than S1. We wound up using Falcon Complete and it's saved our bacon a bunch.",
            "score": 7,
            "author_name": "PapaRoachHarambe",
            "creation_time_utc": "2024-05-12 15:27:45"
        },
        {
            "id": "l3o8qlm",
            "text": "a lot of replies but no real answers so far, i only worked with sentinelone while the learning curve can be a bit steep i do like the product also the data lake (Singularity) to integrate other solutions like M365 logdata and such is useful. On vulnerability detection they are also growing rapidly.",
            "score": 6,
            "author_name": "TWFpa2Vs",
            "creation_time_utc": "2024-05-12 05:09:07"
        },
        {
            "id": "l3pd183",
            "text": "For better or worse….\n\nA lot of applications integrate into CS—more so than S1.   I’m talking about vpn/znta/and other misc cyber apps that care about device posture. \n\nWhen filling out cyber insurance forms, crowdstrike is a tick box for Edr/xdr and sentinel one is not.    You’d write that into ‘other’\n\nGoing through external auditors, they’d asking you’re using CA, Defender, carbon Black, etc.    I think S1 is getting mentioned in questions more, but it wasn’t familiar with the bigger auditors as much. \n\nYMMV, but CISOs don’t get fired for running Crowdstrike is probably a large reason it’s so popular.",
            "score": 5,
            "author_name": "tehiota",
            "creation_time_utc": "2024-05-12 12:52:24"
        },
        {
            "id": "l3o33ui",
            "text": "Gartner constantly ranks S1 below Crowdstrike and MS defender so I doubt it",
            "score": 13,
            "author_name": "iMaknificent",
            "creation_time_utc": "2024-05-12 04:13:09"
        },
        {
            "id": "l3oujzc",
            "text": "We had issues sourcing a vendor for CS. S1 is more aimed at MSP’s in my opinion. We’ve also got a SOC monitoring S1 for us.\n\nIt’s just stopped an in progress breach dead once we got the agents on. Not one of our customers hence why they didnt have it. Blitzed straight thru defender.\n\nAs we grow, and if we find a vendor for the right sku’s here in the Uk, we will probably shift over to them as someone else said, insurers go for Crowd Strike if there is ever a breach.\n\nFor now, our setup has been tried and tested, albeit behind many other layers of security, so we will be remaining with S1 and the SOC for now, allowing us to sleep at night.",
            "score": 4,
            "author_name": "ElButcho79",
            "creation_time_utc": "2024-05-12 09:35:12"
        },
        {
            "id": "l3pbknz",
            "text": "S1 is ok but I’ve worked plenty of incidents that it failed to stop….including clients using the S1 managed service. You HAVE to get Deep Visibility for it to be useful and you need staff to know how to use DV. It’s also not uncommon to see S1 not block a lot of actions CrowdStrike would block, including encryption events. That said, CrowdStrike is pricey and they won’t deal with small companies (less than 100 systems). The biggest issue I’ve seen with events….lack of basic security implemented across networks, no staff actively monitoring security tools, and if they are monitoring….don’t know what to look for or how the analyze the data they have.",
            "score": 3,
            "author_name": "AlfredoVignale",
            "creation_time_utc": "2024-05-12 12:39:51"
        },
        {
            "id": "ldxqpcw",
            "text": "It is now",
            "score": 3,
            "author_name": "dhedge65",
            "creation_time_utc": "2024-07-19 14:47:48"
        },
        {
            "id": "l3o864e",
            "text": "I think CrowdStrike has greater brand-name awareness due to being involved in investigations of multiple high-profile cybersecurity incidents. That sort of thing inevitably makes them “sound better” to C-level execs.\n\nI think their platform layout is a little more confusing than SentinelOne but that’s subjective. I’m also not sure if CrowdStrike offers multi-tenant management yet.",
            "score": 5,
            "author_name": "muchograssya55",
            "creation_time_utc": "2024-05-12 05:03:01"
        },
        {
            "id": "l3o29f0",
            "text": "SentinelOne is the better tool.  But it’s probably harder to use.  A lot of people like easy whether it’s the best or not.  Hence Meraki…",
            "score": 15,
            "author_name": "bkb74k3",
            "creation_time_utc": "2024-05-12 04:05:10"
        }
    ]
}