{
    "title": "Kaseya EDR vs SentinelOne",
    "text": "Like many MSP’s we decided to sign up for Kaseya 365 during their blitzkrieg. We currently use Sentinel One and it made sense to move even if we never decided to switch to Kaseya’s EDR. That said, Sentinel One is a billing hassle compared to what Kaseya EDR would be, the S1 portal is a pain, and, ya it would net us several grand a month to make the switch. But the most important thing is keeping our clients as well protected as possible. Putting aside Kaseya trust issues (are any of them trustworthy..ehhem Crowdstrike) are Kaseya EDR and S1 comparable products? Apart from admin ease and cost, the option of converting the bulk of our clients to Pro to get them MDR which many of them wouldn’t otherwise willingly afford is appealing.",
    "score": 17,
    "creation_time_utc": "2024-08-07 15:00:48",
    "id": "1eme18n",
    "url": "https://www.reddit.com/r/msp/comments/1eme18n/kaseya_edr_vs_sentinelone/",
    "author_name": "Street_Click_3621",
    "comments": [
        {
            "id": "lgy6t0i",
            "text": "Not comparable imo. If you prefer security, stick to S1 out of these two options.",
            "score": 56,
            "author_name": "giffenola",
            "creation_time_utc": "2024-08-07 15:07:05"
        },
        {
            "id": "lgyjiu5",
            "text": "I've personally experienced the frustration of managing multiple security tools**.** SentinelOne, while powerful, often felt like herding cats when it came to policy management and reporting.",
            "score": 22,
            "author_name": "Fluffy-Possession604",
            "creation_time_utc": "2024-08-07 16:12:51"
        },
        {
            "id": "lgylvyw",
            "text": "Stay far, far away from Kaseya’s EDR.  If you think managing S1 is a nightmare, you haven’t seen the half of it.  It’s near impossible to create client specific whitelist rules, reporting and alerting is a joke.  I find it better suited only for threat hunting and even then, it requires much more SOC experience to run than S1.",
            "score": 21,
            "author_name": "itsxenix",
            "creation_time_utc": "2024-08-07 16:24:57"
        },
        {
            "id": "lgyc4gp",
            "text": "No comparison - S1.",
            "score": 26,
            "author_name": "CPAtech",
            "creation_time_utc": "2024-08-07 15:34:49"
        },
        {
            "id": "lh12imm",
            "text": "Current User of Kaseya 365 EDR, RMM, RocketCyber & Autotask.... almost full Kaseya Stack \n\n  \nHere are a few nice things\n\n1) You can easily manage and deploy the EDR via Datto RMM.  \n2) You can tie into RocketCyber / Autotask PSA with ease.   \n3) You can see Alerts / Responses / Quarantines across all organizations without a problem.  \n4) The Alerts -> Rocket Cyber -> Autotask works really well.\n\nThe EDR agent is simple and is embedded with the AV so it is lightweight.\n\nThere are of course more good things, but these are some niceties that you will be happy about.\n\nHere are some issues I have encountered.\n\n1) EDR Policies have so far required me to put in hundreds of exclusions. These are absolute paths, they do not have wildcards... at all.   \n2) These policies are applied at an Org level and at a Location level. This location level groups all workstations and serves together per client/org so you cannot do any separation of policies.  i.e. server policy or custom SQL policy. no, you have to put all your exclusions together and apply it to the whole org.  \n3) The endpoint view is worthless. IF you want to see what alerts, or currently quarantined files per workstation you have to do this via the \"Alerts\"  \n4) You cannot disable the endpoint.. you have to remove the license from that endpoint or uninstall it.  \n5) The program seriously lacks data for why something is quarantined or flagged with the EDR or scanned with the AV. The results are shown to you in JSON format ( which looks to me like a lazy solution for a half-baked product)\n\nMy biggest gripe is that the program has no \"Flow\". It is difficult for my technicians to know what they should do next. The Alerts section has a response button but this only offers so much! You have to then know to go to the Respond section.. find that file that was flagged in alerts and then perform some actions. The action is \"Unquarantine\" and that then gets magically added to a hidden list that I am told will put in an exclusion so it is not flagged again. But you cannot see that list.\n\nWe are committed to 3 years of this product so we are making it work, but honestly, I would not recommend this product at its current stage of development. \n\nI am being told to \"Recommend\" changes via there custom form and that makes me thing this product is being beta-tested on MSP's.",
            "score": 11,
            "author_name": "fuze-17",
            "creation_time_utc": "2024-08-08 00:17:18"
        },
        {
            "id": "lh2vp4f",
            "text": "The place I work at is using Kaseya 365\nIt’s ok, worth it if you already use Kaseya for everything.\n\nDatto EDR does a pretty good job but a fair amount of false positives, easy to exclude these.\nDoesn’t hog resources and runs smoothly. but the lack of documentation is confusing or sometimes contradicts eachother. We have had some weird issues with large hosts or VMs usually terminal environments or security cam servers writing large amounts of data constantly having EDR duplicating its service till CPU is spiked at 100% and shit goes sideways. But this only happened on 3 servers\n\nI have only used Datto EDR. I assume that most EDR services may have little hiccups with large servers writing huge amounts of data constantly. And some false positives for custom software developed for specific customers.\n\nThe management portal is ok. And does integrate with RMM well.\n\nI’d recommend having everything configured properly before deployment like uninstall password (if you leave this blank and need to uninstall you’re shit out of luck if the device is isolated)\nWeirdly Datto RMM isn’t configured by default to work if a device is isolated. You need to add Datto RMMs links and IP’s in the isolation configuration.\n\nThe cloud backups is weird that you only get 5TB free. Doesn’t matter if you manage 100 endpoints or 1000. Originally it was 250gb per endpoint which was too good to be true. But is reasonably priced if you go over.\n\n\nOnly reason we wanted it, our billing system is a pain and using one provider like Kaseya saved a ton of hours and administrative costs.\n\nPlus we managed to get a 12 month agreement at a really good price.",
            "score": 5,
            "author_name": "Jit_litass",
            "creation_time_utc": "2024-08-08 09:05:49"
        },
        {
            "id": "lgya9eb",
            "text": "There are no valid reasons to ever do business with Kaseya.",
            "score": 37,
            "author_name": "BurfdayCakes",
            "creation_time_utc": "2024-08-07 15:25:08"
        },
        {
            "id": "lh072s2",
            "text": "Lol. S1. Don't even think about it twice.",
            "score": 9,
            "author_name": "notyouraveragesys",
            "creation_time_utc": "2024-08-07 21:15:26"
        },
        {
            "id": "lh01p1g",
            "text": "Even kaseya uses s1 internally.",
            "score": 7,
            "author_name": "First_Ingenuity_1755",
            "creation_time_utc": "2024-08-07 20:47:38"
        },
        {
            "id": "lgznobz",
            "text": "If you think Sentinel One is a billing hassle, I can't wait to hear what you have to say about Kaseya after a year.\n\nI don't think I'll ever buy anything from Kaseya again.",
            "score": 9,
            "author_name": "night_filter",
            "creation_time_utc": "2024-08-07 19:36:35"
        }
    ]
}