{
    "title": "Sentinel one ",
    "text": "I was on a sales call with ConnectWise rmm. They were offering the “full-fledged” sentinel one vs other rmm’s that bundle rmm’s with S1. They said other companies like N-able give you a “watered-down” version where they put you under their tenant and you can’t see full compliance reports and other stuff he wasn’t sure on the specifics. \n\nWondering if you guys have any insight on this ?",
    "score": 4,
    "creation_time_utc": "2024-08-28 23:22:48",
    "id": "1f3nqix",
    "url": "https://www.reddit.com/r/msp/comments/1f3nqix/sentinel_one/",
    "author_name": "sliphqq21",
    "comments": [
        {
            "id": "lkf2ukw",
            "text": "There used to be a watered-down version that had some management directly in N-central but no real S1 console access. It was called “integrated EDR” at N-able. It was garbage. I think they stopped selling it two years ago. \n\nBack then and now today, you can get S1 Complete with Vigilance, direct from N-able and manage it directly at S1. You will still be under N-able’s tenant, but can still add your own customers and assign logins to them at their level. I believe some add-on SKUs like Ranger for AD are not yet available due to N-able billing issues, but that may no longer be the case. They sometimes call it “outergrated EDR” or “standalone EDR” at N-able. \n\nMy guess is the CW S1 is like this second N-able offering.",
            "score": 12,
            "author_name": "IllustriousRaccoon25",
            "creation_time_utc": "2024-08-28 23:32:49"
        },
        {
            "id": "lkf1wg8",
            "text": "Why? You can get S1 directly or through Pax8 with no commitment. CW is probably wanting at least a 1 year and the discount will probably be way less than the cost to lower license counts or try and get away from them.\n\nDon't put your eggs all in one basket.",
            "score": 21,
            "author_name": "Sliffer21",
            "creation_time_utc": "2024-08-28 23:27:27"
        },
        {
            "id": "lkfri4r",
            "text": "They are twisting old info around trying to make themselves look better.  I've been using pretty much the full CW stack for 15  years.  Even spent a number of  years as a independent CW consultant working with MSP's all over the world get setup and customize their stack.  At this point we are pretty much walking away from their entire stack.  Automate is not getting any Dev work, RMM is not a usable product and won't be for atleast 2 years if ever, CW Sell breaks and their own support can't fix it, Manage is still decent until it breaks and then good luck getting support to be useful.  We do IT risk assessments with all of our vendors now and I can't even explain how low CW scored as a company.",
            "score": 7,
            "author_name": "chilids",
            "creation_time_utc": "2024-08-29 02:02:42"
        },
        {
            "id": "lkf2pk8",
            "text": "Yeah, listen to the egg guy",
            "score": 15,
            "author_name": "ObeseBMI33",
            "creation_time_utc": "2024-08-28 23:32:01"
        },
        {
            "id": "lkg0nn0",
            "text": "Connectwise will lie and screw you. The sales folks can say whatever they want. My previous employer was told that NOC was “included” so we might as well turn it on. We got billed and they fought with us over the contract for months. Fuck those guys. \n\nTheir SOC managed S1 didn’t seem to have any benefits to us except for them going through and marking the false positives for us. Big fucking whoop.",
            "score": 4,
            "author_name": "medium0rare",
            "creation_time_utc": "2024-08-29 03:03:03"
        },
        {
            "id": "lkfozot",
            "text": "This isn’t true by the way.  We use N-Able and we have S1, and we log directly into the S1 portal to manage it. The rep even told me they did it this way, so if we ever device to leave, we don’t have to rip out all our EDR and replace it.  N-Able also allows all the options and add/ons for S1.",
            "score": 2,
            "author_name": "bkb74k3",
            "creation_time_utc": "2024-08-29 01:47:03"
        },
        {
            "id": "lkgo536",
            "text": "The CW offering is no different to what Pax8 and others offer, just it comes with an annoying 1 year contract and painful support vs month to month like others",
            "score": 2,
            "author_name": "gamelord327",
            "creation_time_utc": "2024-08-29 06:24:50"
        },
        {
            "id": "lkfbalv",
            "text": "If you’re using the version that is integrated with the rmm, yes it is going to be limited to the capabilities that the rmm has integrated. I will say that NAble can give you access to the sentinelone tenant so that you do have full access, same with pax 8…",
            "score": 2,
            "author_name": "OgPenn08",
            "creation_time_utc": "2024-08-29 00:22:38"
        },
        {
            "id": "lkfk5kk",
            "text": "They are behind on the times. You get a full fledged S1 tenant with nable.\nThey are trying to get us to switch also. They said they would beat anyone’s pricing andwe told them what nable offered and they said they would match that 😂",
            "score": 1,
            "author_name": "johnsonflix",
            "creation_time_utc": "2024-08-29 01:16:54"
        },
        {
            "id": "lkht8cf",
            "text": "In my experience I’d go as direct as possible as sometimes the resellers portals aren’t at the global level. \n\nI think it was bitdefender that I purchased through a reseller (can’t recall the exact specifics now) and when I wanted to use the API I found that it was at a level above where my portal existed and that made it off limits for my use. \n\nAfter that I always try to buy from a direct distributor / reseller and trial first if I can.",
            "score": 1,
            "author_name": "mgnicks",
            "creation_time_utc": "2024-08-29 12:47:32"
        }
    ]
}